In [10]:
pip install sqlalchemy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: sqlalchemy in /Users/damac20/Library/Python/3.8/lib/python/site-packages (1.4.42)
WARNING: You are using pip version 20.2.3; however, version 22.3 is available.
You should consider upgrading via the '/Library/Developer/CommandLineTools/usr/bin/python3 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [1]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (2.9.5)
Note: you may need to restart the kernel to use updated packages.

In [2]:
!pip install ipython-sql

Collecting ipython-sql
  Using cached ipython_sql-0.4.1-py3-none-any.whl (21 kB)
Collecting prettytable<1
  Using cached prettytable-0.7.2.zip (28 kB)
  Preparing metadata (setup.py) ... done
Requirement already satisfied: sqlalchemy>=0.6.7 in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (1.4.39)
Requirement already satisfied: ipython>=1.0 in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (7.31.1)
Requirement already satisfied: ipython-genutils>=0.1.0 in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: six in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython-sql) (1.16.0)
Collecting sqlparse
  Using cached sqlparse-0.4.3-py3-none-any.whl (42 kB)
Requirement already satisfied: backcall in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: pygments in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (2.11.2)
Requirement already satisfied: appnope in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: pexpect>4.3 in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: setuptools>=18.5 in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (63.4.1)
Requirement already satisfied: matplotlib-inline in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.1.6)
Requirement already satisfied: traitlets>=4.2 in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: pickleshare in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: greenlet!=0.4.17 in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from pexpect>4.3->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in /Users/damac20/opt/anaconda3/lib/python3.9/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py) ... done
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13695 sha256=036cf78e45f43c9009e48bebc56c907b2f150f4cecb7755f1cc1be5b513c0b06
  Stored in directory: /Users/damac20/Library/Caches/pip/wheels/75/f7/28/77a076f1fa8cbeda61aca712815d04d7a32435f04a26a2dd7b
Successfully built prettytable
Installing collected packages: prettytable, sqlparse, ipython-sql
Successfully installed ipython-sql-0.4.1 prettytable-0.7.2 sqlparse-0.4.3

In [3]:
%load_ext sql

In [4]:
from sqlalchemy import create_engine

In [5]:
%sql postgresql://gnsiobsurufrtp:0d57af453839e69ec694c32f5af9f06d938697b08d2c4e279403aa9eeed31661@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r

creating a table

In [6]:
%%sql

DROP TABLE  IF EXISTS Address_books_crit;

CREATE TABLE Address_books_crit
 (  
    ID int,
    Title varchar(255),
    Author varchar(255),
    ISBN int,
    Publish_Date date
    
    
    );

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
Done.
Done.

[]

Inserting values

In [7]:
%%sql
INSERT INTO Address_books_crit(ID, Title, Author, ISBN, Publish_Date)
VALUES(1,'Holding Up the Universe','Null',567-456-789-5,'2002-07-05'),
      (2,'A woman makes a plan', 'Maye Musk', 983-758-274-2, '2020-04-17 '), 
      (3,'Mindset' ,'DR Carol S. Dweck',213-986-123-4,'2017-01-10'),
      (4, 'Disney Princess','kenny calvin',789-435-123-1 ,'2018-08-21'),
      (5,'The leader who had no title','maxwel mac',1847378773,'2010-04-01');

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[]

In [8]:
%%sql
SELECT * FROM Address_books_crit

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[(1, 'Holding Up the Universe', 'Null', -683, datetime.date(2002, 7, 5)),
 (2, 'A woman makes a plan', 'Maye Musk', -51, datetime.date(2020, 4, 17)),
 (3, 'Mindset', 'DR Carol S. Dweck', -900, datetime.date(2017, 1, 10)),
 (4, 'Disney Princess', 'kenny calvin', 230, datetime.date(2018, 8, 21)),
 (5, 'The leader who had no title', 'maxwel mac', 1847378773, datetime.date(2010, 4, 1))]

Updating the values in a table created

In [9]:
%%sql

UPDATE Address_books_crit
SET author='Jennifer Niven'

WHERE id=1;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
1 rows affected.

[]

In [10]:
%%sql
SELECT * FROM Address_books_crit

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[(2, 'A woman makes a plan', 'Maye Musk', -51, datetime.date(2020, 4, 17)),
 (3, 'Mindset', 'DR Carol S. Dweck', -900, datetime.date(2017, 1, 10)),
 (4, 'Disney Princess', 'kenny calvin', 230, datetime.date(2018, 8, 21)),
 (5, 'The leader who had no title', 'maxwel mac', 1847378773, datetime.date(2010, 4, 1)),
 (1, 'Holding Up the Universe', 'Jennifer Niven', -683, datetime.date(2002, 7, 5))]

Deleting values from a table

In [11]:

%%sql
DELETE FROM  Address_books_crit
WHERE Publish_Date='2017-01-10' AND Author = 'The leader who had no title'

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
0 rows affected.

[]

In [12]:
%%sql
SELECT * FROM Address_books_crit

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[(2, 'A woman makes a plan', 'Maye Musk', -51, datetime.date(2020, 4, 17)),
 (3, 'Mindset', 'DR Carol S. Dweck', -900, datetime.date(2017, 1, 10)),
 (4, 'Disney Princess', 'kenny calvin', 230, datetime.date(2018, 8, 21)),
 (5, 'The leader who had no title', 'maxwel mac', 1847378773, datetime.date(2010, 4, 1)),
 (1, 'Holding Up the Universe', 'Jennifer Niven', -683, datetime.date(2002, 7, 5))]

Sorting values in ascending order

In [13]:
%%sql


SELECT
	title,
	author
	
FROM Address_books_crit
	
ORDER BY
	title ASC,
	author ASC;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[('A woman makes a plan', 'Maye Musk'),
 ('Disney Princess', 'kenny calvin'),
 ('Holding Up the Universe', 'Jennifer Niven'),
 ('Mindset', 'DR Carol S. Dweck'),
 ('The leader who had no title', 'maxwel mac')]

In [14]:
%%sql
SELECT * FROM Address_books_crit

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.

[(2, 'A woman makes a plan', 'Maye Musk', -51, datetime.date(2020, 4, 17)),
 (3, 'Mindset', 'DR Carol S. Dweck', -900, datetime.date(2017, 1, 10)),
 (4, 'Disney Princess', 'kenny calvin', 230, datetime.date(2018, 8, 21)),
 (5, 'The leader who had no title', 'maxwel mac', 1847378773, datetime.date(2010, 4, 1)),
 (1, 'Holding Up the Universe', 'Jennifer Niven', -683, datetime.date(2002, 7, 5))]

Selecting only the first three rows

In [15]:
%%sql

SELECT
	title,
	author,
	Publish_Date
	
    
FROM Address_books_crit
	
ORDER BY
	title
LIMIT 3;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
3 rows affected.

[('A woman makes a plan', 'Maye Musk', datetime.date(2020, 4, 17)),
 ('Disney Princess', 'kenny calvin', datetime.date(2018, 8, 21)),
 ('Holding Up the Universe', 'Jennifer Niven', datetime.date(2002, 7, 5))]

popular one by searching

In [48]:
%%sql
ALTER TABLE Address_books_crit
Add Column Search_Count int;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
Done.

[]

In [49]:
%%sql
ALTER TABLE Address_books_crit
Add Column Book_quantity int;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
Done.

[]

Searching the most popular book

In [50]:
book_search= input("Please enter the  book title you want to search: ")
author_search= input("Please enter the book author you want to search: ")
collected_author_data = %sql SELECT author  from  Address_books_crit
collected_book_data = %sql SELECT title  from  Address_books_crit


%sql UPDATE Address_books_crit
%sql SET search_count = search_count + 1
%sql WHERE book_search = collected_book_data and author_search = collected_author_data;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.
 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.
 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
(psycopg2.errors.SyntaxError) syntax error at end of input
LINE 1: UPDATE Address_books_crit
                                 ^

[SQL: UPDATE Address_books_crit]
(Background on this error at: https://sqlalche.me/e/14/f405)
 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
(psycopg2.errors.SyntaxError) syntax error at or near "+"
LINE 1: SET search_count = search_count + 1
                                        ^

[SQL: SET search_count = search_count + 1]
(Background on this error at: https://sqlalche.me/e/14/f405)
 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
(psycopg2.errors.SyntaxError) syntax error at or near "WHERE"
LINE 1: WHERE book_search = collected_book_data and author_search = ...
        ^

[SQL: WHERE book_search = collected_book_data and author_search = collected_author_data;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [16]:
%%sql

SELECT
   COUNT(*)
FROM
 Address_books_crit;

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
1 rows affected.

[(5,)]

In [28]:
#%%sql

title1 = %sql SELECT title from Address_books_crit;

print(title1)

counter = %sql select count(*) from  Address_books_crit;

print(counter)

book_search= input("Please enter the  book title you want to search: ")
count=len(title1)
p = list(title1[0])
p[0]


q = list(title1[0])
q[0]

x=0
y=0
K=0

print(count)

while (y < count):

   if book_search == p[x]:# and author_search == q[x] :

       print(p[x])
       print(q[x])
       K=K+1 
       x=x+1
       break


   else: 

    print("Sorry there is no match!!")
    break

print(K)

 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
5 rows affected.
+-----------------------------+
|            title            |
+-----------------------------+
|     A woman makes a plan    |
|           Mindset           |
|       Disney Princess       |
| The leader who had no title |
|   Holding Up the Universe   |
+-----------------------------+
 * postgresql://gnsiobsurufrtp:***@ec2-18-234-17-166.compute-1.amazonaws.com:5432/d37pct9o6m3u5r
1 rows affected.
+-------+
| count |
+-------+
|   5   |
+-------+
5
A woman makes a plan
A woman makes a plan
1